Tekla Open API Reference for Tekla Structures 2025
SurfaceTreatment.Father Property
 Defines the father part for the surface treatment: the part that the surface treatment is created on.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Part Father { get; set; }
Public Property Father As Part
	Get
	Set
Property Value
Type: Part
See Also
Reference
SurfaceTreatment Class
Tekla.Structures.Model Namespace